src/cf/Documents/otus_ЗаявкаОнбординг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>otus_ЗаявкаОнбординг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетДоступов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_ПакетыДоступов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НужноОборудование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_СтатусыЗаявкиОнбординга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиВРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/Otus_ЭтапыОнбординга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Otus_ЭтапыОнбординга</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_СтатусыЭтапаОнбординга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дедлайн</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФакта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>CorrelationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastRequestId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.otus_ЗаявкаОнбординг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_ТипыЭтапов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/otus_СтатусыЗаявкиОнбординга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>otus_СтатусыЗаявкиОнбординга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Звершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/otus_СтатусыЭтапаОнбординга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>otus_СтатусыЭтапаОнбординга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/otus_ЗаявкаОнбординг/Ext/ObjectModule.bsl
Процедура ЗаполнитьЭтапыОнбординга() Экспорт
     Если ЭтотОбъект.Статус <> Перечисления.otus_СтатусыЗаявкиОнбординга.ВРаботе И
        ЭтотОбъект.Статус <> Перечисления.otus_СтатусыЗаявкиОнбординга.Звершено Тогда
        
            Заявка = ЭтотОбъект.Ссылка;
            Набор = РегистрыСведений.Otus_ЭтапыОнбординга.СоздатьНаборЗаписей();
            Отбор = Набор.Отбор.Заявка;
            
            Отбор.Установить(Заявка);
            Набор.Очистить();
            
            Если ЭтотОбъект.НужноОборудование Тогда
                
                ЕстьЭтапОборудование = ЭтотОбъект.ПакетДоступов.Этапы.НайтиСтроки(Новый Структура("ТипЭтапа", Справочники.otus_ТипыЭтапов.Оборудование)).Количество();
                
                Если Не ЕстьЭтапОборудование Тогда
                    
                    НовыеДанные = Набор.Добавить();
                    НовыеДанные.Заявка = Заявка;
                    НовыеДанные.ТипЭтапа = Справочники.otus_ТипыЭтапов.Оборудование;
                    НовыеДанные.НомерЭтапа = 99;
                    НовыеДанные.СтатусЭтапа = Перечисления.otus_СтатусыЭтапаОнбординга.Ожидает;
                    НовыеДанные.Дедлайн = ТекущаяДатаСеанса() + 48 * 60;
                    НовыеДанные.CorrelationId = Строка(Новый УникальныйИдентификатор);
                    
                    Набор.Записать();     
                КонецЕсли;
            КонецЕсли;
            
            Для Каждого Этап Из ЭтотОбъект.ПакетДоступов.Этапы Цикл
                
                НовыеДанные = Набор.Добавить();
                НовыеДанные.Заявка = Заявка;
                НовыеДанные.ТипЭтапа = Этап.ТипЭтапа;
                НовыеДанные.НомерЭтапа = Этап.Порядок;
                НовыеДанные.СтатусЭтапа = Перечисления.otus_СтатусыЭтапаОнбординга.Ожидает;
                НовыеДанные.Дедлайн = ТекущаяДатаСеанса() + Этап.SLAЧасов * 3600;
                НовыеДанные.CorrelationId = Строка(Новый УникальныйИдентификатор);
                
                Набор.Записать(); 
                
            КонецЦикла;
            
            
        КонецЕсли;
    КонецПроцедуры
    
Процедура ПриЗаписи(Отказ)
    ЗаполнитьЭтапыОнбординга();
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
    ЭтотОбъект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.Черновик;
КонецПроцедуры
